# CategoryType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..CategoryType Property
ExportLayerInfo Class See Also
---
The category type which this layer belongs to.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public LayerCategoryType CategoryType { get; set; }
```

Visual Basic
---
```text
Public Property CategoryType As LayerCategoryType
	Get
	Set
```

Visual C++
---
```text
public:
property LayerCategoryType CategoryType {
	LayerCategoryType get ();
	void set (LayerCategoryType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace